{"pageProps":{"post":{"attributes":{},"html":"<p>Let&#39;s talk about the CD in CI/CD. How do we get our code from code to deployed? GitHub and Vercel!</p>\n<p>There are a trillion ways to do this but in this I&#39;d say let&#39;s just lean into Vercel - they&#39;re the Next.js people, might as well let them do their thing. We <em>could</em> build our app on GitHub and then take the loose files and deploy those to Vercel, but in this case Vercel is so optimized for Next.js I&#39;m just inclined to let them work their magic.</p>\n<p>The cool is it&#39;s kinda already set up. Vercel does a really good job making this easy. It can be a huge pain in the ass to get it going on other platforms, and Vercel just makes it work for the average case so well. We really even get preview deployments sorta for free.</p>\n<p>What will happen now, by default, is that Vercel will deploy everything in master automatically. There&#39;s a lot of other ways to do this, but I generally like the idea &quot;every commit that makes it into master should be able to make it to production.&quot; With this idea, this deployment pipeline works great.</p>\n<p>By default, GitHub will also not let you deploy unless your tests pass (assuming you&#39;ve set up Actions, which we will here shortly.)</p>\n<p>Let&#39;s do something fun. Open a PR for something visual on the site : change a button color, add big text, anything. But do it in a branch, and then open a PR on GitHub for it.</p>\n<p>I just made one and it&#39;ll look something like this: <a href=\"https://github.com/btholt/fullstack-next-wiki/pull/2\">make everything red PR</a>. You won&#39;t be able to see the PR as you&#39;re not on my Vercel team, but you can see Vercel deploys it for me, makes a preview available, that once I&#39;ve merged we can then promote to production. This will also run the CI (which we&#39;ll set up in the next section.)</p>\n<p>Another cool thing: you can go in to the preview deploy and leave blocking comments that will block the merging on the PR until the PR author fixes them. Makes it awesome to give to product, marketing or executives who can hold things in new and more difficult ways (I&#39;m mostly kidding.)</p>\n<blockquote>\n<p>Vercel has &quot;deployment checks&quot; in their UI. If you&#39;re following along with me, you don&#39;t need them as the GitHub integration picks those up automatically. This would be if you were not using that.</p>\n</blockquote>\n","markdown":"Let's talk about the CD in CI/CD. How do we get our code from code to deployed? GitHub and Vercel!\n\nThere are a trillion ways to do this but in this I'd say let's just lean into Vercel - they're the Next.js people, might as well let them do their thing. We _could_ build our app on GitHub and then take the loose files and deploy those to Vercel, but in this case Vercel is so optimized for Next.js I'm just inclined to let them work their magic.\n\nThe cool is it's kinda already set up. Vercel does a really good job making this easy. It can be a huge pain in the ass to get it going on other platforms, and Vercel just makes it work for the average case so well. We really even get preview deployments sorta for free.\n\nWhat will happen now, by default, is that Vercel will deploy everything in master automatically. There's a lot of other ways to do this, but I generally like the idea \"every commit that makes it into master should be able to make it to production.\" With this idea, this deployment pipeline works great.\n\nBy default, GitHub will also not let you deploy unless your tests pass (assuming you've set up Actions, which we will here shortly.)\n\nLet's do something fun. Open a PR for something visual on the site : change a button color, add big text, anything. But do it in a branch, and then open a PR on GitHub for it.\n\nI just made one and it'll look something like this: [make everything red PR][red]. You won't be able to see the PR as you're not on my Vercel team, but you can see Vercel deploys it for me, makes a preview available, that once I've merged we can then promote to production. This will also run the CI (which we'll set up in the next section.)\n\nAnother cool thing: you can go in to the preview deploy and leave blocking comments that will block the merging on the PR until the PR author fixes them. Makes it awesome to give to product, marketing or executives who can hold things in new and more difficult ways (I'm mostly kidding.)\n\n> Vercel has \"deployment checks\" in their UI. If you're following along with me, you don't need them as the GitHub integration picks those up automatically. This would be if you were not using that.\n\n[red]: https://github.com/btholt/fullstack-next-wiki/pull/2\n","slug":"continuous-delivery","title":"Continuous Delivery","section":"DevOps","icon":"cogs","filePath":"/home/runner/work/build-a-fullstack-nextjs-app-v4/build-a-fullstack-nextjs-app-v4/lessons/09-devops/C-continuous-delivery.md","nextSlug":"/lessons/devops/continuous-integration","prevSlug":"/lessons/devops/speed-insights-analytics-and-observability"}},"__N_SSG":true}